# 注释：#   快捷键：ctrl + /
'''
    注释的分类：单行注释，多行注释
    注释的作用：
    1、注释是给人看的，不是给机器看的。
    2、注释是不会被解释器执行的代码。解释器会忽略掉注释中的所有内容。
    3、注释是 程序猿 / 程序媛 之间的交流工具。

    注释的注意点：
    1、注释是不能相互嵌套的。
    2、一定要养成书写注释的好习惯。
    3、注释一定要有确切的表达意义。

    # 这个功能很牛B，只有上帝和我知道是什么含义。
    # 现在，这个功能只有上帝知道是什么意义了。
'''

# 这是一个“佛主保佑”的输出内容（多行字符串）
fozhu = '''
                     _ooOoo_
                    o8888888o
                    88" . "88
                    (| -_- |)
                     O\ = /O
                 ____/`---'\____
               .   ' \\| |// `.
                / \\||| : |||// \\
              / _||||| -:- |||||- \\
                | | \\\ - /// | |
              | \_| ''\---/'' | |
               \ .-\__ `-` ___/-. /
            ___`. .' /--.--\ `. . __
         ."" '< `.___\_<|>_/___.' >'"".
        | | : `- \`.;`\ _ /`;.`/ - ` : | |
          \ \ `-. \_ __\ /__ _/ .-` / /
  ======`-.____`-.___\_____/___.-`____.-'======
                     `=---='
 
  .............................................
           佛祖保佑             永无BUG
'''

print(fozhu)    # 这就是注释